{
  "_name_or_path": "philomath-1209/programming-language-identification",
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Scala",
    "1": "JavaScript",
    "2": "COBOL",
    "3": "ARM Assembly",
    "4": "R",
    "5": "Lua",
    "6": "C++",
    "7": "Visual Basic .NET",
    "8": "Go",
    "9": "Erlang",
    "10": "C#",
    "11": "Rust",
    "12": "Ruby",
    "13": "Swift",
    "14": "Mathematica/Wolfram Language",
    "15": "PHP",
    "16": "Fortran",
    "17": "AppleScript",
    "18": "Pascal",
    "19": "Java",
    "20": "PowerShell",
    "21": "Python",
    "22": "C",
    "23": "Perl",
    "24": "Kotlin",
    "25": "jq"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ARM Assembly": 3,
    "AppleScript": 17,
    "C": 22,
    "C#": 10,
    "C++": 6,
    "COBOL": 2,
    "Erlang": 9,
    "Fortran": 16,
    "Go": 8,
    "Java": 19,
    "JavaScript": 1,
    "Kotlin": 24,
    "Lua": 5,
    "Mathematica/Wolfram Language": 14,
    "PHP": 15,
    "Pascal": 18,
    "Perl": 23,
    "PowerShell": 20,
    "Python": 21,
    "R": 4,
    "Ruby": 12,
    "Rust": 11,
    "Scala": 0,
    "Swift": 13,
    "Visual Basic .NET": 7,
    "jq": 25
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.36.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 52000
}